Revit 2027 API
RailingType.PrimaryHandrailType Property
 The type of the primary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PrimaryHandrailType { get; set; }
Public Property PrimaryHandrailType As ElementId
	Get
	Set
public:
property ElementId^ PrimaryHandrailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member PrimaryHandrailType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The handRailTypeId is not a valid hand rail type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace